In [1]:
import pandas as pd

*Elements of our DataFrame

In [2]:
DataFrame_elements={"Model":['hp15','hp14','hp15s'],
                    "Processor":['Ryzen5','Ryzen5','Ryzen7'],
                    "Price":[58000,48000,65000]
    
}

## Creating our DataFrame

In [3]:
Data_Frame=pd.DataFrame(DataFrame_elements)

In [4]:
Data_Frame

   Model Processor  Price
0   hp15    Ryzen5  58000
1   hp14    Ryzen5  48000
2  hp15s    Ryzen7  65000